simulacoes/bump/rhoPimpleFoam/subSonico/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(U|B|e).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0;
    }

    "(p|rho).*"
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }

//    p
//    {
//        solver          PCG;
//        preconditioner  DIC;
//        tolerance       1e-6;
//        relTol          0;
//    }
    
    pFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }
     
    pB
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-06;
        relTol          0;
    }

    pBFinal
    {
        $pB;
        relTol          0;
    }

}

PIMPLE
{
    nOuterCorrectors     1;
    nCorrectors          3;
    nNonOrthogonalCorrectors 0;
}

BPISO
{
    nCorrectors     3;
}


// ************************************************************************* //
